app/controllers/api/v1/products_of_carts_controller.rb

  def index
    @products_of_carts = ProductsOfCart.all
---
SELECT "products_of_carts".* FROM "products_of_carts"

  def update
    if @products_of_cart.update(products_of_cart_params)
---
UPDATE "products_of_carts" SET "length_product" = $1, "price_for_product" = $2, "updated_at" = $3 WHERE "products_of_carts"."id" = $4  [["length_product", 2], ["price_for_product", 74.29], ["updated_at", "2022-01-29 01:55:24.427565"], ["id", 1]]

  def set_products_of_cart
    # @products_of_cart = ProductsOfCart.includes(:stocks, :contents).find_by_id(params[:id])
    @products_of_cart = ProductsOfCart.find_by_id(params[:id])
---
SELECT "products_of_carts".* FROM "products_of_carts" WHERE "products_of_carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]