nhs-back/app/controllers/api/v1/shopping_carts_controller.rb

  def index
    @shopping_carts = ShoppingCart.all
---
SELECT "shopping_carts".* FROM "shopping_carts"

  def update
    if @shopping_cart.update(delivery_params)
---
UPDATE "shopping_carts" SET "total_price" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["total_price", 1.0], ["updated_at", "2022-01-29 02:25:37.596149"], ["id", 4]]

  def set_shopping_cart
    @shopping_cart = ShoppingCart.find(params[:id])
---
SELECT "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]