nhs-back/app/controllers/api/v1/stocks_controller.rb

INSERT INTO "stocks" ("product_id", "avaliable", "reserved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 5], ["avaliable", 4], ["reserved", 1], ["created_at", "2022-01-29 01:58:02.050295"], ["updated_at", "2022-01-29 01:58:02.050295"]]
---
  def create
    @stock = Stock.new(stock_params)

    if @stock.save